/*
题目描述
题目标题：

将两个整型数组按照升序合并，并且过滤掉重复数组元素。
输出时相邻两数之间没有空格。
请注意本题有多组样例。



输入描述:
输入说明，按下列顺序输入：
1 输入第一个数组的个数
2 输入第一个数组的数值
3 输入第二个数组的个数
4 输入第二个数组的数值

输出描述:
输出合并之后的数组

示例1
输入
复制
3
1 2 5
4
-1 0 3 2
输出
复制
-101235

排序 去重
*/

#include<stdio.h>
int main()
{
    /**********输入*****************************/
    int i, m, n, a[1000];
    while (scanf("%d", &m) != EOF)
    {
        for (i = 0; i < m; i++)
        {
            scanf("%d", &a[i]);
        }
        scanf("%d", &n);
        for (i = 0; i < n; i++)
        {
            scanf("%d", &a[m + i]); //接第一个
        }
        /**********冒泡*****************************/
        int tmp, j, k;
        for (j = 0; j < m + n - 1; j++)
            for (k = j + 1; k < m + n; k++) //去重
            {
                if (a[j] > a[k])
                {
                    tmp = a[j];
                    a[j] = a[k];
                    a[k] = tmp;
                }
            }
        /**********输出*****************************/
        for (i = 0; i < m + n; i++)
        {
            if (a[i] != a[i + 1])
                printf("%d", a[i]);
        }
        printf("\n");
    }
    return 0;
}
